package com.ksh.dto;

import lombok.Data;

@Data
public class LoginRequest {
  private String email, password;
}
/*
* PMO(Project Management Office)가 DTO를 강조하는 이유
* PMO는 개발을 직접 하지는 않지만, 프로젝트의 품질, 일정, 리스크를 철저하게 통제하는 컨트롤 타워
* 특히 여러 개발자가 투입되는 규모있는 에이전시 프로젝트나,
* 복잡한 업무 시스템을 구축할 때 PMO가 DTO 사용을 표준 가이드로 강제하는 이유는
*
* 1. 치명적인 리스크 사전 차단
*   PMO의 최우선 과제는 프로젝트를 엎어지게 만들 수 있는 버그나 보안 사고를 미연에 방지하는 것
*   앞서 언급한 "권한 탈취"나 "데이터 변조"같은 보안 취냑점은 시스템 인수에 치명적인 결격 사유
*   보안 사고를 차단하는 DTO 아키텍처를 강제함으로써 프로젝트 전체의 리스크를 크게 낮출 수 있음
*
* 2. 코드 품질 표준화(Standardization)
*   다양한 인력이 투입되는 환경에서는 개발자마다 코딩 스타일이 다름
*   어떤 사름은 Entity를 통째로 넘기고, 어떤 사람은 Map을 쓰고,
*   어떤 사람은 DTO를 쓴다면 코드가 파편화되어 나중에 인수인계나
*   유지보수가 불가능해짐/ "API 요청과 응답에는 무조건 DTO를 사용한다"는
*   단호한 규칙을 세워 아키텍처의 일관성을 꽉 잡아주는 역할을 함
*
* 3. 향후 유지보수 비용 절감(TCO 관리)
*   PMO는 프로젝트 오픈 이후의 운영 비용까지 고려해야 함
*   화면 요구사항이나 UI/UX 변경으로 인해 API 스텍이 바뀌었다고 해서
*   데이터베이스 뼈대(Entity)까지 흔들리는 구조는 유지보수 비용을
*   기하급수적으로 높임. DTO를 통해 화면(프론트엔드)과 DB(백엔드 코어)를
*   완벽하게 단절시켜 두면 향후 요구사항이 변경되더라도 백엔드 핵심 로직을
*   안전하게 보호하여 대응할 수 있음
*/